const Map<String, Map<String, String>> categoryDetailsAr = {
  'حيوانات': {
    'emoji': '🐢',
    'explanation': 'تشير هذه الكلمات إلى أسماء الحيوانات أو مخلوقات تعيش في القصة مثل السلحفاة أو الأرنب.'
  },
  'أشخاص': {
    'emoji': '🧒',
    'explanation': 'تشمل الكلمات التي تدل على أشخاص أو أسماء شخصيات موجودة في القصة مثل سامر أو المعلمة أو عمر.'
  },
  'أشياء': {
    'emoji': '📦',
    'explanation': 'كلمات تدل على أشياء يمكن رؤيتها أو لمسها مثل حقيبة أو شجرة أو كتاب.'
  },
  'أماكن': {
    'emoji': '🏠',
    'explanation': 'الكلمات التي تصف الأماكن المختلفة مثل البيت أو المدرسة أو الغابة أو المدينة.'
  },
  'صفات': {
    'emoji': '🎨',
    'explanation': 'تصف هذه الكلمات شكلًا أو لونًا أو صفة أو شعورًا مثل "سعيد" أو "حكيم" أو "ذكي".'
  },
  'أفعال': {
    'emoji': '🏃',
    'explanation': 'تشير هذه الكلمات إلى الأعمال أو الأفعال التي يقوم بها الأشخاص أو الحيوانات مثل "يركض" أو "يفكر".'
  },
  'مفاهيم': {
    'emoji': '💡',
    'explanation': 'كلمات تعبّر عن أفكار أو مفاهيم معنوية، مثل الصداقة أو الصدق أو المساعدة.'
  },
  'مشاعر': {
    'emoji': '❤️',
    'explanation': 'تشمل الكلمات التي تدل على المشاعر والأحاسيس مثل الحزن أو السعادة أو القلق أو الخوف.'
  },
};
